Repository: GPSBabel/gpsbabel
Catalog: tags/gpsbabel_1_3_4/gpsbabel/win32/gui-2/locale/*/LC_MESSAGES/default.po
Languages: de

source: About
de: Über

source: This program is part of the GPSBabel project, hosted on
de: Dieses Programm ist Bestandteil des Projektes "GPSBabel", zu finden auf

source: Translations
de: Übersetzungen

source: Find more info at
de: Mehr Info's unter

source: The frontend for GPSBabel command line program
de: Das Windows-Fontend für "gpsbabel.exe"

source: THIS SOFTWARE MAY ONLY BE LICENSED FREE OF CHARGE
de: DIESE SOFTWARE KANN UND DARF NUR KOSTENLOS WEITERGEGEBEN WERDEN

source: Adding a new language
de: Eine neue Sprache hinzufügen

source: by
de: von

source: day(s),
de: Tag(e),

source: hour(s),
de: Stunde(n),

source: minute(s),
de: Minute(n),

source: second(s)
de: Sekunde(n)

source: Title for new tracks
de: Titel für neu erstellte Tracks

source: Tit&le
de: Tite&l

source: Split track into several tracks depending on date of trackpoint
de: Erzeuge mehrere Tracks abhängig vom Datum der Trackpunkte

source: &Split
de: &Splitten

source: Shift all tracks
de: Tracks um ein Zeitintervall verschieben

source: &Move
de: Verschieben

source: Take only trackpoints starting at
de: beginne bei Zeitpunkt ...

source: Start at
de: Beginnend am

source: stop at
de: bis zum

source: Pack all tracks into one track (No duplicate timestamps)
de: Alle Tracks zu einem einzigen zusammenfassen (doppelte Zeitstempel unzulässig)

source: &Pack (or)
de: &Packen (oder)

source: Merge all tracks into one track
de: Fasse alle Tracks zu einem einzigen zusammen (doppelte Zeitstempel werden verworfen)

source: Merge
de: Zusammenführen

source: Shift start/stop by local timezone offset
de: Verschiebe Beginn/Ende um Differenz zur lokalen Zeitzone

source: Synthesize course values
de: Generiere Kurs-Werte

source: Course
de: Kurs

source: Synthesize speed values
de: Generiere Geschwindigkeitswerte

source: Speed
de: Geschwindigkeit

source: &Routes && Tracks
de: &Routen && Tracks

source: limit to
de: auf maximal

source: Points
de: Punkte

source: Simplify routes and tracks by limited number of points
de: Limitiert die Anzahl von Wegpunkten in Routen und Tracks

source: Simplify
de: Vereinfachen

source: Upper limit of points for routes and tracks
de: Maximale Anzahl an Punkten innerhalb von Routen und Tracks

source: Reverse routes and tracks
de: Reihenfolge von Wegpunkten in Routen und Tracks umdrehen

source: Reverse
de: Umdrehen

source: File based filters
de: Datei basierende Filter

source: &Waypoints
de: &Wegpunkte

source: Latitude
de: Breitengrad

source: Longitude
de: Längengrad

source: Merge waypoints with duplicate locations
de: Fasse Wegpunkte mit gleichen Koordinaten zusammen

source: locations
de: Koordinaten

source: Merge waypoints with duplicate "short name"
de: Fasse Wegpunkte mit gleichem Namen zusammen

source: "short names"
de: "Kurznamen"

source: Merge waypoints separated by less then
de: Fasse alle Wegpunkte zusammen, die weniger als ... auseinander liegen

source: Sort waypoints by "short name" or by description
de: Sortiere Wegpunkte nach Name oder Beschreibung

source: Sort
de: Sortieren

source: Merge duplicate waypoints
de: Entferne doppelte Wegpunkte

source: Duplicates
de: Duplikate

source: Include points based on their proximity to central point
de: Übernehme nur Punkte mit Entfernung von maximal ... um Mittelpunkt ...

source: Latitude of central point
de: Breitengrad (Latitude) des Mittelpunktes

source: Longitude of central point
de: Längengrad (Longitude) des Mittelpunktes

source: Transform
de: Transformiere

source: Delete source data after transformation
de: Lösche anschließend die internen Quelldaten

source: Delete
de: Lösche

source: Input
de: Eingabe

source: Start the file open dialog
de: Die zu lesende Datei auswählen

source: Options
de: Optionen

source: File
de: Datei

source: Read data from device instead from file
de: Dateneingabe von "Gerät"

source: Device
de: Gerät

source: Options for the selected input format
de: Optionen für das gewählte Eingabe-Format

source: Read data from given filename
de: Lese Daten von Datei ...

source: Characterset for input data
de: Zeichensatz für Eingangsdaten (nicht jedes Format unterstützt dies!)

source: - default -
de: - Standard -

source: Read data from device ...
de: lese von Interface/Anschluß...

source: Format for input from device
de: Eingabeformat des angeschlossenen Gerätes

source: Format for input from file
de: zu benutzendes Eingabeformat

source: Output
de: Ausgabe

source: Start the file save dialog
de: Die zu schreibende Datei auswählen

source: Write data to device instead to file
de: Datenausgabe auf "Gerät"

source: Format for ouput to device
de: Ausgabeformat für angeschlossenes Gerät

source: Options for the selected output format
de: Optionen für das gewählte Ausgabeformat

source: Format for output to file
de: zu benutzendes Ausgabeformat

source: Write data to given filename
de: Dateiname für Datenausgabe

source: Characterset for output data
de: Zeichensatz für Ausgangsdaten (nicht jedes Format unterstützt dies!)

source: Write data to device ...
de: schreibe nach Interface/Anschluß

source: What ?
de: Was?

source: Process waypoint information
de: Wegpunkte in Konvertierung einschließen

source: Process route information
de: Routen in Konvertierung einschließen

source: &Routes
de: &Routen

source: Process track information
de: Tracks in Konvertierung einschließen

source: Start data conversion
de: Konvertierung starten

source: let's go
de: und los

source: Garmin Mapsource mps|*.mps|All files|*.*
de: Garmin Mapsource mps|*.mps|Alle Dateien|*.*

source: All file(s)|*.*|Garmin MapSource mps|*.mps
de: Alle Dateien|*.*|Garmin MapSource mps|*.mps

source: Filter incomming data before writing them to file or device
de: gelesene Daten filtern

source: E&xit
de: Beenden

source: Help
de: Hilfe

source: &About
de: Über

source: &Intro
de: Einführung

source: ... for source format
de: ... für Quellformat

source: ... for target format
de: ... für Zielformat

source: Clear output
de: Meldungen löschen

source: Clear messages
de: Meldungen löschen

source: Enable characterset transformation
de: Zeichensatz transformieren

source: Output to screen
de: Ausgabe auf Bildschirm

source: Change language
de: Sprache ändern

source: &File
de: &Datei

source: &Options
de: &Optionen

source: Synthesize shortnames
de: Synthetisiere Kurznamen

source: Ignore shortnames from source data and synthesize them from description or notes
de: Ignoriere alle "Kurznamen" und generiere diese neu aus Bechreibung oder Bemerkung

source: Force selected GPS data types (nuketypes filter)
de: Erzwinge Selektion(en)

source: &Help
de: &Hilfe

source: Options for ...
de: Optionen für ...

source: Abort
de: Abbrechen

source: German
de: Deutsch

source: French
de: Französisch

source: Spanish
de: Spanisch

source: Hungarian
de: Ungarisch

source: Please have a look at the file README.GUI. There you will find all information you need to get GPSBabelGUI working in your own language.
de: Werfen Sie einen kurzen Blick in die Datei "README.GUI" Dort finden Sie alle nötigen Informationen, um GPSBabelGUI eine neue Sprache beizubringen.

source: Waypoints
de: Wegpunkte

source: Routes
de: Routen

source: Feet
de: "Feet" (engl.)

source: Miles
de: Meilen

source: Not supported by gpsbabel.exe, release %s!
de: Wird von gpsbabel.exe, Version %s, nicht unterstützt!

source: Value (%s) out of range (%g to %g)!
de: Wert (%s) liegt außerhalb des zulässigen Bereiches (%g to %g)!

source: Discard changes?
de: Änderungen verwerfen?

source: Internal development release
de: Interne Entwicklungsausgabe

source: Private release
de: Private Version

source: Special release
de: Spezial-Version

source: The file "gpsbabel.exe" found in current directory is too old!
de: Die Datei "gpsbabel.exe" ist zu alt für diese GUI!

source: All files|*.*
de: Alle Dateien|*.*

source: Select and edit options for "%s"
de: Optionen von "%s" bearbeiten

source: No options available for "%s"
de: "%s" hat keine Optionen!

source: File %s not found.
de: Datei "%s" nicht gefunden.

source: File "%s" exists ! Overwrite ?
de: Datei "%s" existiert bereits! Überschreiben?

source: Warning
de: Warnung

source: Could not run "gpsbabel.exe"!
de: Konnte "gpsbabel.exe" nicht ausführen!

source: Sorry, gpsbabel.exe reported problems!
de: Uhps, da ging etwas schief!

source: Converted successfully from "%s" to "%s".
de: Erfolgreich konvertiert von "%s" zu "%s".

source: Port
de: Schnittstelle

source: Options for "%s"
de: Optionen für "%s"

source: Choose language
de: Wähle Sprache

source: for GUIBabelGUI
de: für GPSBabelGUI

source: for export
de: für Export

source: Be aware, that most options are made for the output side.
de: Achtung: die meisten Optionen sind vermutlich für die Datenausgabe gedacht.

source: Currently we don't have a flag which tells us which direction is used by the options.
de: Wir verfügen z.Z. über kein Merkmal über die Arbeitsweise der Optionen.

source: Short "%s"
de: Abkürzung "%s"

source: Invalid line format!
de: Ungültiger Zeilenaufbau!

source: Unknown option "%s"!
de: Unbekannte Option "%s"!

source: English
de: Englisch

source: Error WINAPI: Could not create "NamedPipe"!
de: Fehler WINAPI: "NamedPipe" konnte nicht erstellt werden!

source: "gpsbabel.exe" not found!!!
de: "gpsbabel.exe" wurde nicht gefunden!!!

source: Could not run "gpsbabel.exe" (Error %d)!
de: Konnte "gpsbabel.exe" nicht ausführen (Fehler %d)!

source: "gpsbabel.exe" returned error 0x%x (%d)
de: "gpsbabel.exe" verließ uns mit Fehler 0x%x (%d)!
