Repository: GPSBabel/gpsbabel
Catalog: gpsbabel/win32/gui-2/locale/*/LC_MESSAGES/gpsbabel.po
Languages: de

source: (integer sec or 'auto') Barograph to GPS time diff
de: Zeitdifferent zwischen Barograph und GPS (ganzz. Sekunden oder 'auto')

source: (USR input) Break segments into separate tracks
de: USR Eingabe: Segmente in seperate Tracks aufteilen

source: (USR output) Merge into one segmented track
de: USR-Ausgabe: zu einem segmentierten Track zusammenfassen

source: Ad-hoc closed icon name
de: Icon allgemein für "geschlossen"

source: Ad-hoc open icon name
de: Icon allgemein für "offen"

source: After output job done sleep n second(s)
de: Pausiere im Anschluß n sekunde(n)

source: Allow whitespace synth. shortnames
de: Erlaube Leerzeichen in Kurznamen

source: Altitudes are absolute and not clamped to ground
de: Absolute Höhenangaben (nicht bodenverbunden)

source: Append icon_descr to description
de: Erweitere Beschreibung um Symbolbeschreibung

source: Base URL for link tag in output
de: Basis-URL für Verknüpfungseintrag

source: Basename prepended to URL on output
de: Basis-Adresse für erzeugte URL's

source: Bitmap of categories
de: Mehrfachkategorie, als Dezimal- oder Hexadezimalwert

source: Category name (Cache)
de: Kategoriename (Cache)

source: Category number to use for written waypoints
de: Benutze Kategorie # beim Schreiben von Wegpunkten (1..16)

source: Color for lines or mapnotes
de: Farbe für Linien oder Kartenangaben

source: Command unit to power itself down
de: Gerät im Anschluß abschalten

source: Complete date-free tracks with given date (YYYYMMDD).
de: Komplettiere Tracks ohne Datumsangaben mit Datum ... (YYYYMMDD)

source: Create unique waypoint names (default = yes)
de: Erzeuge eindeutige Wegpunktnamen (Vorgabe: JA)

source: Create waypoints from geocache log entries
de: Erzeuge Wegpunkte aus Geocache Log-Einträgen

source: Database name
de: Interner Name für die Palm/OS Datenbank

source: Database name (filename)
de: Datenbankname (Dateiname)

source: Datum (default=NAD27)
de: GPS-Datum (Vorgabe: NAD27)

source: Days after which points are considered old
de: Anzahl an Tagen, nach denen Punkte als alt betrachtet werden

source: Decimal seconds to pause between groups of strings
de: Pause (in Sekunden) zwischen Zeilengruppen

source: Default category on output
de: Standardkategorie beim Schreiben

source: Default category on output (1..16)
de: Standard Kategorie (1..16)

source: Default icon name
de: Standard Symbol

source: Default location
de: Vorgabestandort

source: Default proximity
de: Vorgabe-Annäherungsabstand

source: Default speed
de: Standardgeschwindigkeit

source: Default speed for waypoints (knots/hr)
de: Vorgabegeschwindigkeit (Knoten/h)

source: Degrees output as 'ddd', 'dmm'(default) or 'dms'
de: Schreibe Gradangaben in 'ddd', 'dmm' (Vorgabe) oder 'dms' (Gitter)

source: Delete all routes
de: Lösche alle Routen

source: Delete all track points
de: Lösche alle Trackpunkte

source: Delete all waypoints
de: Lösche alle Wegpunkte

source: Display labels on track and routepoints (default = 1)
de: Zeige Beschriftung bei Track- und Routenpunkten (Vorgabe: 1)

source: Distance unit [m=metric, s=statute]
de: Entfernungsangaben [m=Metrisch, s=Statute]

source: Do not add geocache data to description
de: Keine Geocache-Daten zur Beschreibung hinzufügen

source: Do not add URLs to description
de: Hänge keine URL's an die Beschreibung an

source: Don't show gpi bitmap on device
de: Zeige keine Bitmap (Icon) auf dem GPS

source: Draw extrusion line from trackpoint to ground
de: Zeichne eine Verbindungslinie vom Trackpunkt zum Erdboden

source: Drop route points that do not have an equivalent waypoint (hidden points)
de: Lösche versteckte Wegpunkte (automatisch berechnete Routenpunkte)

source: Enable alerts on speed or proximity distance
de: Aktiviere Alarm für Annäherung and Geschwindigkeit

source: Encrypt hints using ROT13
de: Verschlüsselung mit ROT13

source: Encrypt hints with ROT13
de: Verschlüsselung mit ROT13

source: Erase device data after download
de: Nach Download Daten auf dem Gerät löschen

source: Export linestrings for tracks and routes
de: Exportiere Linendaten (linestrings) für Tracks und Routen (Vorgabe: JA)

source: Export placemarks for tracks and routes
de: Exportiere Markierungen für Tracks und Routen

source: Full path to XCSV style file
de: Pfad zur 'XCSV-Style'-Datei

source: Generate # points
de: Erzeuge # Punkte

source: Generate file with lat/lon for centering map
de: Erzeuge Datei mit Breiten- und Längengradwerten (für Kartenzentrierung)

source: Give points (waypoints/route points) a default radius (proximity)
de: Gebe Wegpunkten/Routenpunkten diesen Radius

source: GPS datum (def. WGS 84)
de: GPS-Datum (Vorgabe: WGS 84)

source: Height in pixels of map
de: Kartenhöhe in Pixel

source: Ignore event marker icons on read
de: Ignoriere Ereignis-Icons beim Lesen

source: Include extended data for trackpoints (default = 1)
de: Erweiterte Daten in Trackpoints mit einbeziehen (Vorgabe = 1)

source: Include groundspeak logs if present
de: Groundspeak Log's beifügen (wenn vorhandan)

source: Include major turn points (with description) from calculated route
de: Beziehe Hauptrichtungsänderungen (Ansage vorhanden) mit ein

source: Include only via stations in route
de: Übernehme nur Stationspunkte ('viastations') der Route

source: Include short name in bookmarks
de: Übernehme Kurznamen in Lesezeichen

source: Index of name field in .dbf
de: Index des Namensfeldes innerhalb der .dbf

source: Index of route (if more the one in source)
de: Index des Route (falls mehrere im Eingabeformat)

source: Index of route to write (if more the one in source)
de: Routen-Index (wenn mehrere vorhanden)

source: Index of route/track to write (if more the one in source)
de: Route oder Track-Index (wenn mehrere vorhanden)

source: Index of track (if more the one in source)
de: Index des Tracks (falls mehrere im Eingabeformat)

source: Index of track to write (if more the one in source)
de: Track-Index (wenn mehrere vorhanden)

source: Index of URL field in .dbf
de: Index der URL innerhalb der .dbf

source: Indicate direction of travel in track icons (default = 0)
de: Erzeuge spezielle Icons (Richtungspfeile)

source: Infrastructure closed icon name
de: Icon "Komplex (Infrastruktur) geschlossen"

source: Infrastructure open icon name
de: Icon "Komplex (Infrastruktur) offen"

source: Keep turns if simplify filter is used
de: Erhalte Abbiegungen bei Benutzung des Simplify-Filters (Vereinfachen)

source: Length of generated shortnames
de: Maximale Länge der generierten Kurznamen

source: Length of generated shortnames (default 16)
de: Maximale Länge der zu generierten Kurznamen

source: Line color, specified in hex AABBGGRR
de: Linienfarbe (hex. Angabe in Form AABBGGRR)

source: Make synth. shortnames unique
de: Eindeutige Kurznamen erzeugen

source: MapSend version TRK file to generate (3,4)
de: Generiere TRK-Datei in MapSend-Version # (3,4)

source: Margin for map. Degrees or percentage
de: Begrenzung der Karte (in Grad oder Prozent)

source: Marker type for new points
de: Markierungstyp für neue Punkte

source: Marker type for old points
de: Markierungstyp für alte Punkte

source: Marker type for unfound points
de: Markierungstyp für nicht gefundene Punkte

source: Max length of waypoint name to write
de: Max. Länge der zu schreibenden Wegpunktnamen

source: Max number of comments to write (maxcmts=200)
de: Maximale Anzahl an Kommentaren für die Ausgabe

source: Max shortname length when used with -s
de: Maximale Länge der generierten Kurznamen

source: Max synthesized shortname length
de: Maximale Länge der generierten Kurznamen

source: Merge output with existing file
de: Ausgabe in existierende Datei einfügen

source: MTK compatible CSV output file
de: Ausgabe-CSV-Datei kompatibel zum MTK-Datalogger

source: Name of the 'unassigned' category
de: Name der 'unassigned'-Kategorie

source: New name for the route
de: Name der neuen Route

source: No separator lines between waypoints
de: keine Trennlinien zwischen den Wegpunkten

source: No whitespace in generated shortnames
de: Leerzeichen in Kurznamen unterdrücken

source: Non-stealth encrypted icon name
de: Sichtbar verschlüsselter Symbolname

source: Non-stealth non-encrypted icon name
de: Sichtbar und unverschlüsselter Symbolname

source: Numeric value of bitrate (baud=4800)
de: Baudrate (Vorgabe: 4800)

source: Omit Placer name
de: Placername auslassen

source: Only read turns; skip all other points
de: Lese nur Abbiegungen und ignoriere alle sonstigen Punkte

source: Path to HTML style sheet
de: Pfad zum HTML-Style-Sheet

source: Precision of coordinates
de: Präzision der Koordinaten (Anzahl Nachkommastellen)

source: Proximity distance
de: Standardmäßiger Annäherungsabstand

source: Radius for circles
de: Kreisradius

source: Radius of our big earth (default 6371000 meters)
de: Erdradius in Meter (Vorgabe: 6371000 Meter)

source: Read control points as waypoint/route/none
de: Lese Kontrollpunkte als Wegpunkt/Route/nichts

source: Read/Write date format (i.e. DDMMYYYY)
de: Datumsformat für Ein-/Ausgabe (z.B. DDMMYYYY)

source: Read/Write date format (i.e. yyyy/mm/dd)
de: Datumsformat (z.B. DD.MM.YYYY)

source: Read/write GPGGA sentences
de: Schreibe/Lese GPGGA Sequenzen

source: Read/write GPGSA sentences
de: Schreibe/Lese GPGSA Sequenzen

source: Read/write GPRMC sentences
de: Schreibe/Lese GPRMC Sequenzen

source: Read/write GPVTG sentences
de: Schreibe/Lese GPVTG Sequenzen

source: Read/Write time format (i.e. HH:mm:ss xx)
de: Zeitformat (z.B. HH:mm:ss xx)

source: Retain at most this number of position points (0 = unlimited)
de: Behalte höchstens diese Anzahl an Positionspunkten (0 = kein Limit)

source: Return current position as a waypoint
de: Übertrage aktuelle Position als Wegpunkt

source: Road type changes
de: Straßentyp-Wechsel

source: Set waypoint name to source filename.
de: Erzeuge den Wegpunktnamen an Hand des Dateinames

source: Shortname is MAC address
de: Kurzname ergibt sich aus MAC-Adresse

source: Speed in bits per second of serial port (baud=4800)
de: Übertragungsrate des seriellen Ports in Bits/Sekunde (Vorgabe: baud=4800)

source: Split input into separate files
de: Teile gelesene Daten in seperate Dateien

source: Split into multiple routes at turns
de: Route an Abbiegungen teilen

source: Starting seed of the internal number generator
de: Startwert für internen Zufallszahlengenerator

source: Stealth encrypted icon name
de: Unsichtbar verschlüsselter Symbolname

source: Stealth non-encrypted icon name
de: Unsichtbarer unverschlüsselter Symbolname

source: String to separate concatenated address fields (default=", ")
de: Trennzeichen für zusammengefügte Adressfelder (Vorgabe: ", ")

source: Suppress labels on generated pins
de: Unterdücke Kennzeichnung für erzeugte Pins

source: Suppress retired geocaches
de: Unterdrücke zurückgezogene (?) Geocaches

source: Suppress separator lines between waypoints
de: Keine Trennlinien zwischen den Wegpunkten

source: Suppress use of handshaking in name of speed
de: Kein 'Handshaking' (im Namen der Geschwindigkeit)

source: Suppress whitespace in generated shortnames
de: Keine Leerzeichen in Kurznamen

source: Symbol to use for point data
de: Symbol für Punkte

source: Sync GPS time to computer time
de: Synchronisiere PC-Uhr mit dem GPS (PC -> GPS)

source: Synthesize track times
de: Erzeuge Tracknamen

source: Target GPX version for output
de: Schreibe in GPX-Version (1.0 oder 1.1)

source: Temperature unit [c=Celsius, f=Fahrenheit]
de: Temperatureinheit [c=Celsius, F=Fahrenheit]

source: The icon description is already the marker
de: Die Symbolbeschreibung ist bereits die Markierung

source: Treat waypoints as icons on write
de: Behandle Wegpunkte als Icons beim Schreiben

source: Type of .an1 file
de: .an1 Dateityp

source: Units for altitude (f)eet or (m)etres
de: Höhenangaben in Fuß oder Meter ('f' oder 'm')

source: Units used for names with @speed ('s'tatute or 'm'etric)
de: Einheit für Geschwindigkeit in Wegpunkten [...@30] ( 's'tatute oder 'm'etrisch)

source: Units used when writing comments ('s'tatute or 'm'etric)
de: Einheit innerhalb von Kommentaren ( 's'tatute oder 'm'etrisch)

source: UPPERCASE synth. shortnames
de: Erzeuge Kurznamen in Großbuchstaben

source: Use depth values on output (default is ignore)
de: Tiefenangaben mit ausgeben (normalerweise ausgeschaltet)

source: Use proximity values on output (default is ignore)
de: Benutze Proximity-Werte bei der Ausgabe (Vorgabe: NEIN)

source: Use shortname instead of description
de: Benutze den Kurznamen anstelle der Beschreibung

source: Use specified bitmap on output
de: Benutze spezifische Bitmap (.BMP) für die Ausgabe

source: Version of gdb file to generate (1..3)
de: Schreibe GDB-Version 1, 2 oder 3

source: Version of mapsource file to generate (3,4,5)
de: Schreibe MapSource Datei in Version ... (3,4 oder 5)

source: Waypoint background color
de: Wegpunkt Hintergrundfarbe

source: Waypoint foreground color
de: Wegpunkt Vordergrundfarbe

source: Waypoint type
de: Wegpunkt Typ

source: Width in pixels of map
de: Kartenbreite in Pixel

source: Width of lines, in pixels
de: Linienhöhe in Pixel

source: Write additional node tag key/value pairs
de: Schreibe zusätzliche Wegpunkt (node) Informationspaare (tags)

source: Write additional way tag key/value pairs
de: Schreibe zusätzliche Routen (way) Informationspaare (tags)

source: Write all tracks into one file
de: Schreibe alle Tracks in eine Datei

source: Write description to address field
de: Platziere die Beschreibung im Adressfeld

source: Write each waypoint in a separate file
de: Schreibe jeden Wegpunkt in eine separate Datei

source: Write notes to address field
de: Schreibe Kommentar (Notizen) in das Adressfeld

source: Write position to address field
de: Platziere die Koordinaten im Adressfeld

source: Write position using this grid.
de: Erzeuge Koordinaten unter Benutzung dieses Gitters (Grids).

source: Write timestamps with offset x to UTC time
de: Schreibe Zeitstempel relativ zur UTC + x

source: Write tracks compatible with Carto Exploreur
de: Erzeuge Tracks ohne Titel (kompatibel zu "Carto Exploreur")

source: Write tracks for Gisteq Phototracker
de: Schreibe Tracks für "Gisteq Phototracker"

source: Zoom level to reduce points
de: Vergrößerungsfakter um Punkte zu unterdrücken
